Ran Plan for project: `staging` dir: `terraform` workspace: `staging`

<details><summary>Show Output</summary>

```diff
+---------+---------------------------------------------------------------------------------------+-----------+---------+
| RESULT  |                                         FILE                                          | NAMESPACE | MESSAGE |
+---------+---------------------------------------------------------------------------------------+-----------+---------+
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/main.tf      | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/outputs.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/providers.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/variables.tf | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/versions.tf  | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/backend.tf   | main      | SUCCESS |
| success | /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/data.tf      | main      | SUCCESS |
+---------+---------------------------------------------------------------------------------------+-----------+---------+

data.azurerm_subnet.delegated: Reading...
data.azurerm_subnet.default: Reading...
data.azurerm_private_dns_zone.default: Reading...
data.azurerm_subnet.delegated: Read complete after 0s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/virtualNetworks/vnet-demo/subnets/subnet-pg-delegated]
data.azurerm_subnet.default: Read complete after 0s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/virtualNetworks/vnet-demo/subnets/subnet-app]
data.azurerm_private_dns_zone.default: Read complete after 1s [id=/subscriptions/9e26b669-0edc-4bda-b289-0290b51160bf/resourceGroups/rg-demo/providers/Microsoft.Network/privateDnsZones/privatelink.postgres.database.azure.com]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.postgresql.azurerm_postgresql_flexible_server.default["backstage-demo"] will be created
+ resource "azurerm_postgresql_flexible_server" "default" {
+       administrator_login           = "psqladmin"
+       administrator_password        = (sensitive value)
+       auto_grow_enabled             = false
+       backup_retention_days         = (known after apply)
+       fqdn                          = (known after apply)
+       geo_redundant_backup_enabled  = false
+       id                            = (known after apply)
+       location                      = "brazilsouth"
+       name                          = "backstage-demo"
+       private_dns_zone_id           = (known after apply)
+       public_network_access_enabled = true
+       resource_group_name           = "my-rg"
+       sku_name                      = "GP_Standard_D2s_v3"
+       storage_mb                    = 32768
+       storage_tier                  = "P30"
+       tags                          = {
+           "terraform" = "true"
        }
+       version                       = "14"
+       zone                          = "1"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_configuration.default["backstage-demo"] will be created
+ resource "azurerm_postgresql_flexible_server_configuration" "default" {
+       id        = (known after apply)
+       name      = "azure.extensions"
+       server_id = (known after apply)
+       value     = "CUBE,CITEXT,BTREE_GIST"
    }

  # module.postgresql.azurerm_postgresql_flexible_server_database.default["backstage"] will be created
+ resource "azurerm_postgresql_flexible_server_database" "default" {
+       charset   = "UTF8"
+       collation = "en_US.utf8"
+       id        = (known after apply)
+       name      = "backstage"
+       server_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ pgsq_fqdn                          = (known after apply)
+ pgsq_id                            = (known after apply)

Generating Infracost cost estimates for terraform/staging...

+ infracost breakdown '--path=/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json' '--format=json' '--log-level=debug' '--out-file=/tmp/leandromoreirati-backstage-demo-1/staging-terraform-infracost.json' --no-color
2024-10-01T18:43:14Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2024-10-01T18:43:14Z DEBUG 'POST' request to '/graphql' using trace_id: 'c70eb4d8-f8c7-49ff-8bf9-72630b13ce49'
2024-10-01T18:43:14Z DEBUG performing request method POST url https://dashboard.api.infracost.io/graphql library=retryablehttp
2024-10-01T18:43:14Z DEBUG Successfully loaded settings from Infracost Cloud result="{CloudEnabled:false ActualCostsEnabled:false UsageAPIEnabled:false TagsAPIEnabled:false PoliciesAPIEnabled:false}"
2024-10-01T18:43:14Z DEBUG 'POST' request to '/graphql' using trace_id: 'c70eb4d8-f8c7-49ff-8bf9-72630b13ce49'
2024-10-01T18:43:14Z DEBUG performing request method POST url https://pricing.api.infracost.io/graphql library=retryablehttp
2024-10-01T18:43:15Z DEBUG os env 'ATLANTIS_WRITE_GIT_CREDS=true' matched prefix 'ATLANTIS_'
2024-10-01T18:43:15Z DEBUG fetching Atlantis VCS metadata
2024-10-01T18:43:15Z DEBUG could not get local git file changes, failed to get the previous commit to compare the current commit against, this is likely because of a shallow clone in CI error=EOF
2024-10-01T18:43:15Z INFO Autodetected 1 Terraform plan JSON file project across 1 root module
2024-10-01T18:43:15Z INFO Found Terraform plan JSON file project "-atlantis-data-repos-leandromoreirati-backstage-demo-1-staging-terraform-staging-staging.json" at directory "/atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json"
2024-10-01T18:43:15Z DEBUG Starting evaluation for project "-atlantis-data-repos-leandromoreirati-backstage-demo-1-staging-terraform-staging-staging.json"
2024-10-01T18:43:15Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2024-10-01T18:43:15Z DEBUG Retrieving cloud prices to calculate costs
2024-10-01T18:43:15Z DEBUG Getting pricing details for 3 cost components from https://pricing.api.infracost.io
2024-10-01T18:43:15Z DEBUG 'POST' request to '/graphql' using trace_id: 'c70eb4d8-f8c7-49ff-8bf9-72630b13ce49'
2024-10-01T18:43:15Z DEBUG performing request method POST url https://pricing.api.infracost.io/graphql library=retryablehttp
2024-10-01T18:43:15Z DEBUG Skipping free resource module.postgresql.azurerm_postgresql_flexible_server_configuration.default["backstage-demo"]
2024-10-01T18:43:15Z DEBUG Skipping free resource module.postgresql.azurerm_postgresql_flexible_server_database.default["backstage"]
2024-10-01T18:43:15Z DEBUG Finished evaluation for project "-atlantis-data-repos-leandromoreirati-backstage-demo-1-staging-terraform-staging-staging.json"
2024-10-01T18:43:15Z DEBUG IsCloudEnabled inferred from Config.EnabledDashboard is_cloud_enabled=false
2024-10-01T18:43:15Z DEBUG Skipping sending project results since Infracost Cloud upload is not enabled.
2024-10-01T18:43:15Z DEBUG 'POST' request to '/event' using trace_id: 'c70eb4d8-f8c7-49ff-8bf9-72630b13ce49'
2024-10-01T18:43:15Z DEBUG performing request method POST url https://pricing.api.infracost.io/event library=retryablehttp
2024-10-01T18:43:15Z INFO Output saved to /tmp/leandromoreirati-backstage-demo-1/staging-terraform-infracost.json

Update: A new version of Infracost is available: v0.10.37 → v0.10.39
  $ curl -fsSL https://raw.githubusercontent.com/infracost/infracost/master/scripts/install.sh | sh
2024-10-01T18:43:15Z DEBUG writing 0 objects to filesystem cache
2024-10-01T18:43:15Z DEBUG could not flush pricing API cache to filesystem error="open /atlantis-data/repos/leandromoreirati/backstage-demo/1/staging/terraform/staging-staging.json/.infracost/pricing.gob: not a directory"
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p staging
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://57.152.93.5/lock?id=leandromoreirati%252Fbackstage-demo%252Fterraform%252Fstaging)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p staging
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```